Revit 2024 API
BuiltInFailures.AutoRouteFailures.NoFittingInProjectWarning Property
 The routing solution failed because there is no default fitting type specified or the fitting cannot be found in the project. Ensure the fitting is loaded in the project and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoFittingInProjectWarning { get; }
Visual Basic
Public Shared ReadOnly Property NoFittingInProjectWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoFittingInProjectWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace